list_ = [8, 9, -5, -3, 1, -10, 8, -10, -5, 0, 5, -4, 0, 10, -8, 1, 6, -6, 6, -9]

# TODO найти сумму, количество и среднее арифметическое уникальных чисел

unic = set(list_)
# print("Сумма уникальных чисел:", sum(unic))
# print("Количество уникальных чисел:", len(unic))
# print("Среднее арифметическое уникальных чисел:", sum(unic)/len(unic))
describe = {"Сумма уникальных чисел:": sum(unic),
            "Количество уникальных чисел:": len(unic),
            "Среднее арифметическое уникальных чисел:": round(sum(unic)/len(unic), 5)
            }

print(describe)
